src/InformationRegisters/БлокировкаАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>БлокировкаАссортимента</Name>
			<Comment>Блокировка ассортимента</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/БлокировкаАссортимента/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Блокировка ассортимента"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт;
Перем ПодразделениеКомпании Экспорт; // Подразделение компании
Перем ХозОперация Экспорт;
Перем ДатаБлокировки Экспорт;
Перем РезультатЗапросаПоТоварам Экспорт; // РезультатЗапроса или ТаблицаЗначений.
Перем ОперацияБлокировки Экспорт; // Булево. ИСТИНА-блокировка, ЛОЖЬ-разблокировка

#КонецОбласти

Функция ЕстьДействующаяБлокировка(Контрагент, Номенклатура)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодразделениеКомпании,
	|	Контрагент,
	|	Номенклатура
	|ИЗ
	|	РегистрСведений.БлокировкаАссортимента.СрезПоследних(&Момент, ХозОперация=&ХозОперация И ПодразделениеКомпании=&Подразделение И Контрагент=&Контрагент И Номенклатура=&Номенклатура)
	|ГДЕ
	|	Заблокировано И (СрокДействия>=&Момент ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1))
	|");
	Запрос.УстановитьПараметр("Момент", ДатаБлокировки);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;		
	
КонецФункции //ЕстьДействующаяБлокировка()

Функция УстановитьБлокировку() Экспорт
	
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	
	Результат = Истина;
	Для Каждого СтрокаТовар Из РезультатЗапросаПоТоварам Цикл
		
		Если НЕ ОперацияБлокировки И НЕ ЕстьДействующаяБлокировка(СтрокаТовар.Контрагент, СтрокаТовар.Номенклатура) Тогда
			Результат = Ложь;
			//Ошибки = Ошибки + НСтр("ru = 'Ошибка. Попытка снятия отсутствующей блокировки со следующими параметрами:" + Символы.ПС
			//				+ ?(ЗначениеЗаполнено(ПодразделениеКомпании), "- Подразделение: <" + ПодразделениеКомпании + ">", "")
			//				+ ?(ЗначениеЗаполнено(СтрокаТовар.Контрагент), "- Контрагент: <" + СтрокаТовар.Контрагент + ">", "")
			//				+ ?(ЗначениеЗаполнено(СтрокаТовар.Номенклатура), "- Номенклатура: <" + СтрокаТовар.Номенклатура + ">", "") + ".'") + Символы.ПС;
							
			Попытка
				СтрокаНомер = " " + "Строка" + " №" + СтрокаТовар.НомерСтроки
			Исключение 
				СтрокаНомер = "";
			КонецПопытки;
			ВывестиСообщение(НСтр("ru = 'Невозможно снять блокировку" + ?(ЗначениеЗаполнено(ПодразделениеКомпании), ", по подразделению ""%1""", "") + ?(ЗначениеЗаполнено(СтрокаТовар.Контрагент), ", по контрагенту ""%2""", "") + ?(ЗначениеЗаполнено(СтрокаТовар.Номенклатура), ", для номенклатуры ""%3""", "") + ", поскольку указанная блокировна отсутствует. %4'"), ДокументОбъект, "Товары",,, ПодразделениеКомпании, СтрокаТовар.Контрагент, СтрокаТовар.Номенклатура, СтрокаНомер);
							
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = Добавить();
		НоваяЗапись.Период					= ДатаБлокировки;
		НоваяЗапись.Регистратор				= ДокументОбъект.Ссылка;
		НоваяЗапись.ХозОперация				= ХозОперация;
		НоваяЗапись.ПодразделениеКомпании	= ПодразделениеКомпании;
		НоваяЗапись.Контрагент				= СтрокаТовар.Контрагент;
		НоваяЗапись.Номенклатура			= СтрокаТовар.Номенклатура;
		НоваяЗапись.СрокДействия			= СтрокаТовар.СрокДействия;
		НоваяЗапись.Заблокировано			= ОперацияБлокировки;
		
	КонецЦикла;
	
	// скинем некоторые переменные
	РезультатЗапросаПоТоварам = Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект = Неопределено;
	
	Возврат Результат;
	
КонецФункции //УстановитьБлокировку()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ


//////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ
//////////////////////////////////////////////////////////////////////////////////

ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПустаяСсылка();
ХозОперация = Справочники.ХозОперации.ПустаяСсылка();
ДатаБлокировки        = Неопределено;
ОперацияБлокировки    = Неопределено;

#КонецОбласти

#КонецЕсли
